<a href="https://colab.research.google.com/github/Shambhavi-Gupta/DS_Pandas_Creating-Mean-Row-07/blob/master/DS_Pandas_Creating_Mean_Row_07.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

#**Creating Mean Row**

In [ ]:
mass = pd.Series([0.33 , 4.87 , 5.97 , 0.642 , 1898 , 568 , 86.8 , 102 , 0.0146],
                 index = ['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370],
                     index =['Mercury', 'Venus', 'Earth','Moon', 'Mars', 'Jupiter', 'Saturn','Uranus','Neptune', 'Pluto'])

In [ ]:
df = pd.DataFrame({'Mass':mass , 'Diameter':diameter})

In [ ]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [ ]:
df['pop'] = 0

In [ ]:
df['pop']['Earth'] = 8000000000

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [ ]:
df

              Mass  Diameter         pop
Earth       5.9700     12756  8000000000
Jupiter  1898.0000    142984           0
Mars        0.6420      6792           0
Mercury     0.3300      4879           0
Moon           NaN      3475           0
Neptune   102.0000     49528           0
Pluto       0.0146      2370           0
Saturn    568.0000    120536           0
Uranus     86.8000     51118           0
Venus       4.8700     12104           0

In [ ]:
def create_df(nRows, nCols, maxrand=10):
    arr = np.random.randint(0, maxrand, (nRows, nCols))
    df = pd.DataFrame(arr)
    df.index = ['R' + str(x) for x in np.arange(1, nRows +1)]
    df.columns= ['R' + str(x) for x in np.arange(1, nCols +1)]
    return df

In [ ]:
df.loc['Earth']

Mass        5.970000e+00
Diameter    1.275600e+04
pop         8.000000e+09
Name: Earth, dtype: float64

In [ ]:
df.loc['col_mean'] = 0

In [ ]:
def create_mean_row(df):
    #df.loc['Col_mean'] = [np.mean(df[col]) for col in df.columns]
    df.loc['Col_mean'] = df.mean()
    return df

In [ ]:
df

               Mass  Diameter         pop
Earth        5.9700     12756  8000000000
Jupiter   1898.0000    142984           0
Mars         0.6420      6792           0
Mercury      0.3300      4879           0
Moon            NaN      3475           0
Neptune    102.0000     49528           0
Pluto        0.0146      2370           0
Saturn     568.0000    120536           0
Uranus      86.8000     51118           0
Venus        4.8700     12104           0
col_mean     0.0000         0           0

In [ ]:
np.mean(df['Mass'])

266.66266

In [ ]:
df.drop('col_mean', inplace= True)

In [ ]:
df.drop('pop', axis =1 ,inplace=True)

In [ ]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [ ]:
np.mean(df['Mass'])

296.29184444444445

In [ ]:
df.loc['Col_mean'] = [np.mean(df['Mass']) ,np.mean(df['Diameter'])]

In [ ]:
df

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_mean   296.291844   40654.2

In [ ]:
df.drop('Col_mean')

              Mass  Diameter
Earth       5.9700   12756.0
Jupiter  1898.0000  142984.0
Mars        0.6420    6792.0
Mercury     0.3300    4879.0
Moon           NaN    3475.0
Neptune   102.0000   49528.0
Pluto       0.0146    2370.0
Saturn    568.0000  120536.0
Uranus     86.8000   51118.0
Venus       4.8700   12104.0

In [ ]:
create_mean_row(df)

                 Mass  Diameter
Earth        5.970000   12756.0
Jupiter   1898.000000  142984.0
Mars         0.642000    6792.0
Mercury      0.330000    4879.0
Moon              NaN    3475.0
Neptune    102.000000   49528.0
Pluto        0.014600    2370.0
Saturn     568.000000  120536.0
Uranus      86.800000   51118.0
Venus        4.870000   12104.0
Col_mean   296.291844   40654.2

In [ ]:
df = create_df(5, 3)

In [ ]:
df

    R1  R2  R3
R1   6   8   0
R2   9   4   8
R3   1   1   5
R4   4   0   6
R5   1   3   0

In [ ]:
df.mean()

R1    4.2
R2    3.2
R3    3.8
dtype: float64

In [ ]:
df.mean(axis = 1)

R1    4.666667
R2    7.000000
R3    2.333333
R4    3.333333
R5    1.333333
dtype: float64

In [ ]:
df

    R1  R2  R3
R1   6   8   0
R2   9   4   8
R3   1   1   5
R4   4   0   6
R5   1   3   0

In [ ]:
df['Row_mean'] = df.mean(axis =1)

In [ ]:
df

    R1  R2  R3  Row_mean
R1   6   8   0  4.666667
R2   9   4   8  7.000000
R3   1   1   5  2.333333
R4   4   0   6  3.333333
R5   1   3   0  1.333333

In [ ]:
df.loc['Col_mean'] = df.mean()

In [ ]:
df

           R1   R2   R3  Row_mean
R1        6.0  8.0  0.0  4.666667
R2        9.0  4.0  8.0  7.000000
R3        1.0  1.0  5.0  2.333333
R4        4.0  0.0  6.0  3.333333
R5        1.0  3.0  0.0  1.333333
Col_mean  4.2  3.2  3.8  3.733333

In [ ]:
df.median()

R1          4.100000
R2          3.100000
R3          4.400000
Row_mean    3.533333
dtype: float64

In [ ]:
df.min()

R1          1.000000
R2          0.000000
R3          0.000000
Row_mean    1.333333
dtype: float64

In [ ]:
df.describe()

             R1        R2        R3  Row_mean
count  6.000000  6.000000  6.000000  6.000000
mean   4.200000  3.200000  3.800000  3.733333
std    3.059412  2.785678  3.249615  1.970899
min    1.000000  0.000000  0.000000  1.333333
25%    1.750000  1.500000  0.950000  2.583333
50%    4.100000  3.100000  4.400000  3.533333
75%    5.550000  3.800000  5.750000  4.433333
max    9.000000  8.000000  8.000000  7.000000